#include "Map.h"
#include "DxLib.h"
#include "egudai_Load.h"

int Map::mapSize;
int Map::mainMap[Map::height][Map::width];
int Map::startPosX;
int Map::startPosY;
int Map::maxBlock;
int Map::BlockCount;
Map::Map()
{
	LoadDivGraph("mapchip.png", MapChip, 5, 1, 32, 32, mapChipGraph);
	mapSize=0;
}

void Map::Readmap(int MapNumber, int MapSize)
{
	mapSize = MapSize;
	maxBlock = 0;
	BlockCount = 0;
	/*int Map1[height][width] =
	{
		{0,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,0,0,0,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2},
		{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{0,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
		{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
		{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
	};*/

	int Map1[height][width] = { 0 };
	LoadCSV(Map1, "./tamesi.csv"); //./tamesi.csvは読み込みの確認用に適当に作ったマップ

	for (int y = 0; y < height; y++)
	{
		for (int x = 0; x < width; x++)
		{
			
			mainMap[y][x] = Map1[y][x];
			//プレイヤーの初期座標のマップチップを発見する
			if (mainMap[y][x] == START)
			{
				startPosX = x;
				startPosY = y;
				mainMap[y][x] = 0;
			}
			if (mainMap[y][x] == BLOCK)
			{
				maxBlock++;
			}
		}
	}
	scroll.Init(WIN_WIDTH / 2, WIN_HEIGHT / 2, width * mapSize - WIN_WIDTH / 2, height * mapSize - WIN_HEIGHT / 2);
}

//マップチップの番号を受け取る
int Map::GetMapNumber(double PosX, double PosY)
{
	return mainMap[(int)(PosY / mapSize)][(int)(PosX / mapSize)];
}

//スタート地点のX座標を返す
int Map::GetStartPosX()
{
	return startPosX;
}

//スタート地点のY座標を返す
int Map::GetStartPosY()
{
	return startPosY;
}

//マップ番号を変更する
void Map::ChangeMapNumber(double PosX, double PosY, int mapNumber)
{
	if ((mainMap[(int)(PosY / mapSize)][(int)(PosX / mapSize)] == BLOCK) && (mapNumber == NONE))
	{
		BlockCount++;
	}
	mainMap[(int)(PosY / mapSize)][(int)(PosX / mapSize)] = mapNumber;
}

void Map::Draw()
{
	for (int y = 0; y < height; y++)
	{
		for (int x = 0; x < width; x++)
		{
			DrawGraph(x * mapSize - scroll.GetScrollX() , y * mapSize - scroll.GetScrollY(), mapChipGraph[mainMap[y][x]], true);
		}
	}
	DrawFormatString(0, 0, GetColor(0xFF, 0xFF, 0xFF), "BLOCK %d/%d", BlockCount, maxBlock);
}
